# Banco de Dados - Prof. Sérgio Lifschitz

---

## Exercícios da Aula 3: Continuação com a linguagem SQL DML (consultas)


---


ANTES de começar,  ❗ **não esquecer** ❗ de, antes de mais nada, SALVAR este notebook no ambiente COLAB no drive da tua própria conta GOOGLE.

## PASSO 1: Instalação e Configuração do PostgreSQL

Basta dar PLAY que o script abaixo instalará o SGBD PostgreSQL

In [33]:
# %%capture
# Instalação do PostgreSQL
!sudo apt-get -y -qq update
!pip install sqlalchemy==2.0
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start

W: Skipping acquire of configured file 'main/source/Sources' as repository 'https://r2u.stat.illinois.edu/ubuntu jammy InRelease' does not seem to provide it (sources.list entry misspelt?)
Requirement already satisfied: sqlalchemy==2.0 in /usr/local/lib/python3.10/dist-packages (2.0.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (3.1.1)
 * Starting PostgreSQL 14 database server
   ...done.

## PASSO 2: Preparo do Esquema Relacional EMPRESA

Baixe o esquema e instância de teste do BD EMPRESA neste link: https://drive.google.com/file/d/1zFlLaVJIWZokadeKWICYrWhTW_I2o_Bj/view?usp=sharing

❗Coloque o arquivo baixado *.SQL na **pasta padrão do seu Google Drive** ❗

Em seguida, é só dar PLAY (nas duas células seguintes!) pois os scripts (programas) abaixo preparam o ambiente para realizar consultas SQL no esquema de BD EMPRESA no seu próprio COLAB.

In [1]:
%load_ext sql
%config SqlMagic.autopandas = True

%config SqlMagic.style = '_deprecated_default'

## O que tem q ser editado é na celula abaixo:
<ul>
    <li> Nome do db e senha e user do db </li>
</ul>

In [ ]:
from sqlalchemy import create_engine

%sql postgresql://postgres:password@localhost:5432/db_name

In [3]:
%%sql
DROP SCHEMA IF EXISTS empresa CASCADE;
CREATE SCHEMA empresa;

 * postgresql://postgres:***@localhost:5432/pos_db
Done.
Done.

Empty DataFrame
Columns: []
Index: []

## PASSO 3: Preparando para usar o SGBD PostgreSQL localmente

Mais uma vez, é só dar PLAY (nas duas células seguintes!)

## **Lista de Exercícios**

Prática de SQL sobre o esquema EMPRESA implantado no SGBD PostgreSQL, já considerando a sintaxe completa após as 3 aulas do módulo "Banco de Dados"

### Esquema relacional da **base de dados Empresa**:

Seja o esquema relacional da base de dados simplificada de uma EMPRESA genérica. As chaves primárias (PK) respectivas estão sublinhadas e as chaves estrangeiras em itálico

<img src='https://drive.google.com/uc?id=1JWCG8paO9ksU-22L79Qmnkb4iYAHnlOy'>

A empresa é organizada em departamentos, cada qual tendo um nome, um número de identificação e um empregado (gerente) responsável pelo mesmo. Guarda-se como informação a data a partir da qual o empregado assumiu a gerência do departamento. Um departamento pode estar presente em diversas localidades do país.

Um departamento controla um certo número de projetos, e cada projeto tem um nome, um número de identificação e uma localidade única. Os departamentos têm vários empregados, para os quais guarda-se os respectivos nomes, número de identificação (Ident) na empresa, endereço (End) residencial, sexo, data de nascimento e salário (sal) em reais. Todo empregado tem um empregado que é seu superior hierárquico (supervisor direto - SuperIdent) dentro do departamento, informação que também deve ser mantida no banco de dados.

Um empregado é alocado a um único departamento mas pode trabalhar em mais de um projeto, estes não necessariamente controlados pelo departamento ao qual ele pertence. Controla-se o total de horas semanais (HRS) em que um empregado trabalha em cada projeto.

Para fim de controle de seguro de saúde de cada empregado, deve-se manter informações dos nomes, sexo, data de nascimento e grau de parentesco de seus dependentes. Estes são identificados por seu nome mas, também, pela identidade do empregado do qual dependem.

As restrições de integridade referenciais são: o atributo SuperIdent é chave estrangeira (FK) referenciando a PK da própria tabela EMPREGADO, da mesma forma que IdentGer em DEPARTAMENTO e IdentEmp em TRABALHA_NO e DEPENDENTE. DepNum é FK para a PK Num em DEPARTAMENTO em 3 tabelas: Empregado, Projeto e DepLoc. Por fim, ProjNum é FK em TRABALHA_NO referenciando a PK Num em PROJETO.

**ATENÇÃO:** deve-se dar play na próxima célula sempre que for usar o esquema EMPRESA!

In [5]:
%%sql
SET SCHEMA 'empresa';

 * postgresql://postgres:***@localhost:5432/pos_db
Done.

Empty DataFrame
Columns: []
Index: []

**Consulta exemplo:** Quais empregados trabalham no Departamento de Informática?

In [7]:
%%sql

SELECT ident as IDENTIDADE, nome as NOME_EMPREGADO
FROM empresa.empregado
WHERE depnum in (SELECT num
                  FROM departamento
                  WHERE nome = 'Informatica')

 * postgresql://postgres:***@localhost:5432/pos_db
5 rows affected.

  identidade        nome_empregado
0          8  José Carlos
1         11  Silvano Silva
2         14  Bruno Peixoto
3         20  Raphael Mendes
4         26  Luana Marques

### 1. Listar todos os Números dos projetos e os respectivos Números de departamentos que os controlam.

In [16]:
%%sql
SELECT p.num,d.* FROM empresa.projeto AS p JOIN empresa.departamento AS d ON d.num = p.depnum;

 * postgresql://postgres:***@localhost:5432/pos_db
11 rows affected.

    num num                       nome identger     dataini
0    10   4  Economia                         2  1995-01-01
1    30   4  Economia                         2  1995-01-01
2    20   1  Financeiro                      23  2013-01-04
3     0   2  Historia                        13  1999-11-11
4    40  13  BioInformatica                  12  2011-11-23
5    50  13  BioInformatica                  12  2011-11-23
6    60  15  Nanotecnologia                   1  2012-07-01
7    70  11  Segurança                        1  2012-03-09
8    80  15  Nanotecnologia                   1  2012-07-01
9    90   3  Informatica                      2  1911-11-11
10  100   8  Farmacia                        10  2013-07-09

### 2 Listar todos os Números e Nomes dos projetos, e os respectivos Números e Nomes de departamentos que os controlam.

In [17]:
%%sql
SELECT p.num, p.nome, p.depnum, dep.nome FROM empresa.projeto AS p JOIN empresa.departamento AS dep ON p.depnum = dep.num;

 * postgresql://postgres:***@localhost:5432/pos_db
11 rows affected.

    num             nome depnum                       nome
0    10  Informatizacao       4  Economia
1    30  Reengenharia         4  Economia
2    20  Pagamentos           1  Financeiro
3     0  Excursão             2  Historia
4    40  Genoma              13  BioInformatica
5    50  Big Data            13  BioInformatica
6    60  Reagindo            15  Nanotecnologia
7    70  Câmeras             11  Segurança
8    80  NanoParticulas      15  Nanotecnologia
9    90  CorreçãoBugs         3  Informatica
10  100  Vacinação            8  Farmacia

### 3. Exibir o nome e grau de parentesco dos dependentes juntamente com a identidade e nome dos empregados dos quais dependem.

In [19]:
%%sql
select dep.nome, dep.parentesco, emp.nome, emp.ident from empresa.dependente as dep join empresa.empregado as emp on dep.identemp = emp.ident;

 * postgresql://postgres:***@localhost:5432/pos_db
24 rows affected.

                    nome  parentesco                  nome ident
0   Maria                 FILHA       Joao                     1
1   João                  IRMÃO       Joao                     1
2   José                  PAI         Joao                     1
3   Carlos                PAI         Maria                    2
4   Claudio               IRMÃO       Maria                    2
5   Lurdes                FILHA       Ciclano                  4
6   Lurdinalva            IRMÃ        Ciclano                  4
7   Luan Santana          PAI         Ciclano                  4
8   Elba Ramalho          MÃE         Luciano Mauri            6
9   Preta Gil             IRMÃ        Luciano Mauri            6
10  Fafa de Belem         MÃE         José Carlos              8
11  Gustavo Lima          FILHO       Maria José               9
12  Thaeme                IRMÃ        Jorge Sousa             13
13  Thiago                FILHO       Jorge Sousa             13
14  Maria Cecilia         PRIMA       Bruna Carla             15
15  Rodolfo               PAI         Bruna Carla             15
16  Antônio               PAI         Bianca Lourenco         16
17  Lucas                 FILHO       Felicidade Maria        17
18  Tadeu                 AVÔ         Felicidade Maria        17
19  Agueda                PRIMA       Felicidade Maria        17
20  Luzia                 FILHA       Raphael Mendes          20
21  Ines                  FILHA       Raphaela Fontoura       21
22  Anastacia             MÃE         Paola Silva             23
23  Rita                  AVÓ         Paola Silva             23

### 4. Para cada empregado, mostrar seu nome e sexo, e a identidade e nome do seu superior imediato.

In [26]:
%%sql
select * from empresa.empregado;

 * postgresql://postgres:***@localhost:5432/pos_db
27 rows affected.

,ident,nome,sal,endereco,sexo,datanasc,depnum,superident
0,2,Maria,1000.00,Salvador ...,F,1991-08-12,28319,None
1,17,Felicidade Maria,11255.00,Vitoria ...,F,2000-12-10,28319,22
2,4,Ciclano,1000.00,Portaria Salvadores ...,M,2011-10-11,4,2
3,8,José Carlos,11255.00,São Paulo ...,M,2000-12-10,3,None
4,11,Silvano Silva,22233.00,Salvador ...,M,2000-12-10,3,17
5,13,Jorge Sousa,5598.00,Salvador ...,M,1990-05-30,2,6
6,14,Bruno Peixoto,6554.00,Salvador ...,M,1987-10-05,3,8
7,16,Bianca Lourenco,12335.00,Belo Horizonte ...,F,1992-12-12,2,16
8,18,Luciana Fernandes,1245.00,São Paulo ...,F,1990-05-30,4,21
9,20,Raphael Mendes,22233.00,Rio de Janeiro ...,M,1992-12-12,3,None
10,24,Marcos Guedes,23265.00,Rio de Janeiro ...,M,1992-12-12,4,7
11,25,Natasha Gasparelli,22233.00,São Paulo ...,F,2000-12-10,2,None
12,26,Luana Marques,5222.00,São Paulo ...,F,1992-12-12,3,10
13,27,Simone Estoggliato,2.00,Rio de Janeiro ...,M,1990-05-30,4,None
14,9,Maria José,1245.00,Salvador ...,F,1987-10-05,7,11
15,23,Paola Silva,1245.00,Vitoria ...,F,1990-05-30,1,27
16,15,Bruna Carla,5878.00,Rio de Janeiro ...,F,1992-12-12,9,10
17,19,Ariane Goncalves,23265.00,Vitoria ...,F,1992-12-12,10,18
18,6,Luciano Mauri,23265.00,Rio de Janeiro ...,M,1987-10-05,15,15
19,12,Leandro Silva,5222.00,São Paulo ...,M,1987-10-05,13,7
20,21,Raphaela Fontoura,5222.00,Belo Horizonte ...,F,2000-12-10,14,None
21,7,João Maria,10000.00,Rio de Janeiro ...,M,1990-05-30,6,10
22,5,Severino Buarque,7500.00,Porto Alegre ...,M,1988-03-28,5,None
23,22,Laura Benayon,11255.00,São Paulo ...,F,1992-12-12,2,25
24,3,Caetano Veloso,2000.00,PUC ...,M,2015-11-13,5,None
25,10,Johnny Depp,30001.00,São Joaquim ...,M,2015-11-11,8,2
26,1,Joao,1000.00,São Bernardo do Campo ...,M,1991-08-12,15,None

In [ ]:
%%sql
select emp.nome, emp.sexo, emp.ident, emp.superident , superi.nome from empresa.empregado as emp join empresa.empregado as superi on emp.superident = superi.ident;

 * postgresql://postgres:***@localhost:5432/pos_db
18 rows affected.

                    nome sexo ident superident                  nome
0   Felicidade Maria        F    17         22  Laura Benayon
1   Ciclano                 M     4          2  Maria
2   Silvano Silva           M    11         17  Felicidade Maria
3   Jorge Sousa             M    13          6  Luciano Mauri
4   Bruno Peixoto           M    14          8  José Carlos
5   Bianca Lourenco         F    16         16  Bianca Lourenco
6   Luciana Fernandes       F    18         21  Raphaela Fontoura
7   Marcos Guedes           M    24          7  João Maria
8   Luana Marques           F    26         10  Johnny Depp
9   Maria José              F     9         11  Silvano Silva
10  Paola Silva             F    23         27  Simone Estoggliato
11  Bruna Carla             F    15         10  Johnny Depp
12  Ariane Goncalves        F    19         18  Luciana Fernandes
13  Luciano Mauri           M     6         15  Bruna Carla
14  Leandro Silva           M    12          7  João Maria
15  João Maria              M     7         10  Johnny Depp
16  Laura Benayon           F    22         25  Natasha Gasparelli
17  Johnny Depp             M    10          2  Maria

### 5. Listar os diferentes valores de salários pagos aos empregados da empresa.

In [29]:
%%sql
select distinct sal from empresa.empregado order by sal desc;

 * postgresql://postgres:***@localhost:5432/pos_db
15 rows affected.

         sal
0   30001.00
1   23265.00
2   22233.00
3   12335.00
4   11255.00
5   10000.00
6    7500.00
7    6554.00
8    5878.00
9    5598.00
10   5222.00
11   2000.00
12   1245.00
13   1000.00
14      2.00

### 6. Quais os nomes dos empregados que trabalham menos de 20 horas por semana em algum projeto?

In [ ]:
%%sql
select * from empresa.trabalhano;

 * postgresql://postgres:***@localhost:5432/pos_db
61 rows affected.

   identemp projnum hrs
0         4      30   1
1         4      10   6
2         3      30   3
3         1      10   7
4         1       0   1
..      ...     ...  ..
56       24      80   1
57       25      90   7
58       26     100   8
59       27       0   6
60        3      10   2

[61 rows x 3 columns]

In [42]:
%%sql
select t.identemp, e.nome, sum(t.hrs) from empresa.trabalhano as t  join empresa.empregado as e on t.identemp = e.ident group by t.identemp;

 * postgresql://postgres:***@localhost:5432/pos_db
(psycopg2.errors.GroupingError) column "e.nome" must appear in the GROUP BY clause or be used in an aggregate function
LINE 1: select t.identemp, e.nome, sum(t.hrs) from empresa.trabalhan...
                           ^

[SQL: select t.identemp, e.nome, sum(t.hrs) from empresa.trabalhano as t  join empresa.empregado as e on t.identemp = e.ident group by t.identemp;]
(Background on this error at: https://sqlalche.me/e/20/f405)

### 7. Apresentar os nomes de todos os empregados que não têm dependentes.

In [30]:
%%sql
select nome from empresa.empregado where ident not in (select distinct identemp from empresa.dependente);

 * postgresql://postgres:***@localhost:5432/pos_db
14 rows affected.

                    nome
0   Silvano Silva
1   Bruno Peixoto
2   Luciana Fernandes
3   Marcos Guedes
4   Natasha Gasparelli
5   Luana Marques
6   Simone Estoggliato
7   Ariane Goncalves
8   Leandro Silva
9   João Maria
10  Severino Buarque
11  Laura Benayon
12  Caetano Veloso
13  Johnny Depp

### 8. Quais empregados tem cargos de chefia, isto é, não têm superior imediato?

In [31]:
%%sql
select nome from empresa.empregado where superident is null;

 * postgresql://postgres:***@localhost:5432/pos_db
9 rows affected.

                   nome
0  Maria
1  José Carlos
2  Raphael Mendes
3  Natasha Gasparelli
4  Simone Estoggliato
5  Raphaela Fontoura
6  Severino Buarque
7  Caetano Veloso
8  Joao

### 9. Listar todos os locais onde se encontram departamentos da empresa ou onde são realizados projetos.

In [43]:
%%sql
select local from empresa.deploc UNION select local from empresa.projeto;

 * postgresql://postgres:***@localhost:5432/pos_db
10 rows affected.

             local
0  Belo Horizonte
1  Queimadas
2  Natal
3  Salvador
4  Porto Alegre
5  Florianopolis
6  Vitoria
7  Cabo Frio
8  Rio de Janeiro
9  São Paulo

### 10. Apresentar o resultado dos salários dos empregados que trabalham no projeto “Reengenharia” caso fosse dado um aumento de 10%.

In [47]:
%%sql
select e.nome, e.sal*(1.1) from empresa.empregado as e where e.ident in
(select identemp from empresa.trabalhano as t join empresa.projeto as p on t.projnum = p.num where p.nome = 'Reengenharia');

 * postgresql://postgres:***@localhost:5432/pos_db
6 rows affected.

                   nome   ?column?
0  Ciclano                1100.000
1  Raphael Mendes        24456.300
2  Bruna Carla            6465.800
3  João Maria            11000.000
4  Caetano Veloso         2200.000
5  Johnny Depp           33001.100

### 11. Quais os nomes dos empregados e os números de departamento dos quais eles são gerentes, se o forem?

In [50]:
%%sql
select e.nome, d.nome from empresa.empregado as e join empresa.departamento as d on e.ident = d.identger order by e.nome;

 * postgresql://postgres:***@localhost:5432/pos_db
17 rows affected.

                    nome                       nome
0   Ariane Goncalves      Matematica
1   Bruna Carla           Entregas
2   Caetano Veloso        Biologia
3   Joao                  Segurança
4   Joao                  Nanotecnologia
5   João Maria            RH
6   Johnny Depp           Farmacia
7   Jorge Sousa           Historia
8   Leandro Silva         BioInformatica
9   Luciano Mauri         Fisica
10  Maria                 Informatica
11  Maria                 Economia
12  Maria                 Pesquisa
13  Maria José            Pessoal
14  Paola Silva           Financeiro
15  Raphaela Fontoura     Quimica
16  Severino Buarque      Engenharia

In [51]:
%%sql
select e.nome, count(*) from empresa.empregado as e join empresa.departamento as d on e.ident = d.identger group by e.nome order by e.nome;

 * postgresql://postgres:***@localhost:5432/pos_db
14 rows affected.

                    nome  count
0   Ariane Goncalves          1
1   Bruna Carla               1
2   Caetano Veloso            1
3   Joao                      2
4   João Maria                1
5   Johnny Depp               1
6   Jorge Sousa               1
7   Leandro Silva             1
8   Luciano Mauri             1
9   Maria                     3
10  Maria José                1
11  Paola Silva               1
12  Raphaela Fontoura         1
13  Severino Buarque          1

### 12. Listar os nomes dos empregados, assim como os departamentos onde trabalham, que ganham mais do que qualquer empregado do departamento de nome *Pesquisa*

In [55]:
%%sql
select * from empresa.projeto as p full join empresa.departamento as d on p.depnum= d.num  ;

 * postgresql://postgres:***@localhost:5432/pos_db
20 rows affected.

,num,nome,local,depnum,num,nome,identger,dataini
0,10,Informatizacao,Belo Horizonte,4,4,Economia,2,1995-01-01
1,30,Reengenharia,Belo Horizonte,4,4,Economia,2,1995-01-01
2,20,Pagamentos,Salvador,1,1,Financeiro,23,2013-01-04
3,0,Excursão,Florianopolis,2,2,Historia,13,1999-11-11
4,40,Genoma,Rio de Janeiro,13,13,BioInformatica,12,2011-11-23
5,50,Big Data,São Paulo,13,13,BioInformatica,12,2011-11-23
6,60,Reagindo,São Paulo,15,15,Nanotecnologia,1,2012-07-01
7,70,Câmeras,Rio de Janeiro,11,11,Segurança,1,2012-03-09
8,80,NanoParticulas,Belo Horizonte,15,15,Nanotecnologia,1,2012-07-01
9,90,CorreçãoBugs,Rio de Janeiro,3,3,Informatica,2,1911-11-11
10,100,Vacinação,São Paulo,8,8,Farmacia,10,2013-07-09
11,None,None,None,None,9000,Engenharia,5,1957-03-09
12,None,None,None,None,12,Fisica,6,2011-07-15
13,None,None,None,None,28319,Pesquisa,2,2010-02-02
14,None,None,None,None,7,Pessoal,9,2012-10-11
15,None,None,None,None,9,Entregas,15,2010-07-25
16,None,None,None,None,6,RH,7,2011-03-30
17,None,None,None,None,5,Biologia,3,2012-12-12
18,None,None,None,None,10,Matematica,19,2010-05-08
19,None,None,None,None,14,Quimica,21,2013-02-27

### 13. Listar os nomes dos empregados que trabalham o mesmo total de horas em algum projeto em que o empregado Caetano Veloso trabalha

In [ ]:
%%sql

### 14. Quais empregados ganham o maior salário? Listar identidade, nome e salário.

In [57]:
%%sql
select nome, sal, ident from empresa.empregado where sal = (select max(sal) from empresa.empregado);

 * postgresql://postgres:***@localhost:5432/pos_db
1 rows affected.

                   nome       sal ident
0  Johnny Depp           30001.00    10

### 15. Quais os nomes dos empregados que ganham os 3 maiores salários da empresa?

In [84]:
%%sql
select nome, sal from empresa.empregado order by sal desc,nome asc limit 3;

 * postgresql://postgres:***@localhost:5432/pos_db
3 rows affected.

                   nome       sal
0  Johnny Depp           30001.00
1  Ariane Goncalves      23265.00
2  Luciano Mauri         23265.00

# OUTRAS e NOVAS CONSULTAS podem ser propostas para prática de SQL nesta Sprint.

⚡ **Fiquem atentos ao Discord!**  ⚡

# Seguem, abaixo, as células com as consultas resolvidas!


---


❗**NÃO OLHAR ANTES de TENTAR FAZER** ❗

In [61]:
%%sql
SELECT Num AS NumProjeto, DepNum as NumDeptoControlador
FROM Projeto

 * postgresql://postgres:***@localhost:5432/pos_db
11 rows affected.

   numprojeto numdeptocontrolador
0          10                   4
1          30                   4
2          20                   1
3           0                   2
4          40                  13
5          50                  13
6          60                  15
7          70                  11
8          80                  15
9          90                   3
10        100                   8

In [62]:
%%sql
SELECT P.Num AS NumProjeto, P.Nome as NomeProjeto, D.Num as NumDepto, D.Nome as NomeDepto
FROM Projeto P INNER JOIN Departamento D
ON P.Depnum = D.Num

 * postgresql://postgres:***@localhost:5432/pos_db
11 rows affected.

   numprojeto      nomeprojeto numdepto                  nomedepto
0          10  Informatizacao         4  Economia
1          30  Reengenharia           4  Economia
2          20  Pagamentos             1  Financeiro
3           0  Excursão               2  Historia
4          40  Genoma                13  BioInformatica
5          50  Big Data              13  BioInformatica
6          60  Reagindo              15  Nanotecnologia
7          70  Câmeras               11  Segurança
8          80  NanoParticulas        15  Nanotecnologia
9          90  CorreçãoBugs           3  Informatica
10        100  Vacinação              8  Farmacia

In [64]:
%%sql
SELECT Depe.Nome, Parentesco, Ident, Emp.Nome
FROM DEPENDENTE as Depe INNER JOIN EMPREGADO as Emp
ON IdentEmp = Ident;

 * postgresql://postgres:***@localhost:5432/pos_db
24 rows affected.

                    nome  parentesco ident                  nome
0   Maria                 FILHA          1  Joao
1   João                  IRMÃO          1  Joao
2   José                  PAI            1  Joao
3   Carlos                PAI            2  Maria
4   Claudio               IRMÃO          2  Maria
5   Lurdes                FILHA          4  Ciclano
6   Lurdinalva            IRMÃ           4  Ciclano
7   Luan Santana          PAI            4  Ciclano
8   Elba Ramalho          MÃE            6  Luciano Mauri
9   Preta Gil             IRMÃ           6  Luciano Mauri
10  Fafa de Belem         MÃE            8  José Carlos
11  Gustavo Lima          FILHO          9  Maria José
12  Thaeme                IRMÃ          13  Jorge Sousa
13  Thiago                FILHO         13  Jorge Sousa
14  Maria Cecilia         PRIMA         15  Bruna Carla
15  Rodolfo               PAI           15  Bruna Carla
16  Antônio               PAI           16  Bianca Lourenco
17  Lucas                 FILHO         17  Felicidade Maria
18  Tadeu                 AVÔ           17  Felicidade Maria
19  Agueda                PRIMA         17  Felicidade Maria
20  Luzia                 FILHA         20  Raphael Mendes
21  Ines                  FILHA         21  Raphaela Fontoura
22  Anastacia             MÃE           23  Paola Silva
23  Rita                  AVÓ           23  Paola Silva

In [65]:
%%sql
SELECT E.Nome as NomeEmpregado, E.Sexo as SexoEmpregado, S.Ident as IdentSuperior, S.Nome as SexoSuperior
FROM EMPREGADO as E INNER JOIN EMPREGADO as S
ON E.SUPERIDENT= S.IDENT;

 * postgresql://postgres:***@localhost:5432/pos_db
18 rows affected.

           nomeempregado sexoempregado identsuperior          sexosuperior
0   Felicidade Maria                 F            22  Laura Benayon
1   Ciclano                          M             2  Maria
2   Silvano Silva                    M            17  Felicidade Maria
3   Jorge Sousa                      M             6  Luciano Mauri
4   Bruno Peixoto                    M             8  José Carlos
5   Bianca Lourenco                  F            16  Bianca Lourenco
6   Luciana Fernandes                F            21  Raphaela Fontoura
7   Marcos Guedes                    M             7  João Maria
8   Luana Marques                    F            10  Johnny Depp
9   Maria José                       F            11  Silvano Silva
10  Paola Silva                      F            27  Simone Estoggliato
11  Bruna Carla                      F            10  Johnny Depp
12  Ariane Goncalves                 F            18  Luciana Fernandes
13  Luciano Mauri                    M            15  Bruna Carla
14  Leandro Silva                    M             7  João Maria
15  João Maria                       M            10  Johnny Depp
16  Laura Benayon                    F            25  Natasha Gasparelli
17  Johnny Depp                      M             2  Maria

In [66]:
%%sql
SELECT E.Ident as IdentSuper, E.NOME as NomeSuper, S.NOME as NomeSub, S.SEXO as SexoSub
FROM EMPREGADO as E, EMPREGADO as S
WHERE E.SUPERIDENT= S.IDENT;

 * postgresql://postgres:***@localhost:5432/pos_db
18 rows affected.

   identsuper             nomesuper               nomesub sexosub
0          17  Felicidade Maria      Laura Benayon              F
1           4  Ciclano               Maria                      F
2          11  Silvano Silva         Felicidade Maria           F
3          13  Jorge Sousa           Luciano Mauri              M
4          14  Bruno Peixoto         José Carlos                M
5          16  Bianca Lourenco       Bianca Lourenco            F
6          18  Luciana Fernandes     Raphaela Fontoura          F
7          24  Marcos Guedes         João Maria                 M
8          26  Luana Marques         Johnny Depp                M
9           9  Maria José            Silvano Silva              M
10         23  Paola Silva           Simone Estoggliato         M
11         15  Bruna Carla           Johnny Depp                M
12         19  Ariane Goncalves      Luciana Fernandes          F
13          6  Luciano Mauri         Bruna Carla                F
14         12  Leandro Silva         João Maria                 M
15          7  João Maria            Johnny Depp                M
16         22  Laura Benayon         Natasha Gasparelli         F
17         10  Johnny Depp           Maria                      F

In [67]:
%%sql
SELECT DISTINCT Sal
FROM EMPREGADO;

 * postgresql://postgres:***@localhost:5432/pos_db
15 rows affected.

         sal
0   12335.00
1    2000.00
2   30001.00
3       2.00
4   23265.00
5    5878.00
6    6554.00
7    1245.00
8    5222.00
9   10000.00
10   1000.00
11  22233.00
12  11255.00
13   5598.00
14   7500.00

In [68]:
%%sql
SELECT DISTINCT Nome
FROM EMPREGADO INNER JOIN TRABALHANO
ON Ident = IdentEmp
WHERE HRS < 20;

 * postgresql://postgres:***@localhost:5432/pos_db
27 rows affected.

                    nome
0   Luciano Mauri
1   Paola Silva
2   Raphaela Fontoura
3   Joao
4   Luciana Fernandes
5   Maria
6   Ariane Goncalves
7   Bruna Carla
8   Severino Buarque
9   Ciclano
10  Luana Marques
11  Laura Benayon
12  Caetano Veloso
13  Raphael Mendes
14  Johnny Depp
15  Felicidade Maria
16  Jorge Sousa
17  Marcos Guedes
18  Natasha Gasparelli
19  José Carlos
20  Leandro Silva
21  Bianca Lourenco
22  João Maria
23  Bruno Peixoto
24  Simone Estoggliato
25  Silvano Silva
26  Maria José

In [69]:
%%sql
SELECT nome
FROM empregado
WHERE ident NOT IN
  (SELECT identEmp
   FROM   Dependente)

 * postgresql://postgres:***@localhost:5432/pos_db
14 rows affected.

                    nome
0   Silvano Silva
1   Bruno Peixoto
2   Luciana Fernandes
3   Marcos Guedes
4   Natasha Gasparelli
5   Luana Marques
6   Simone Estoggliato
7   Ariane Goncalves
8   Leandro Silva
9   João Maria
10  Severino Buarque
11  Laura Benayon
12  Caetano Veloso
13  Johnny Depp

In [ ]:
#8 Quais empregados tem cargos de chefia, isto é, não têm superior imediato?
%%sql
SELECT nome
FROM empregado
WHERE superident is NULL

In [70]:
%%sql
( SELECT	Local 	FROM		PROJETO )
UNION  -- ou UNION ALL
( SELECT	Local 	FROM		DEPLOC )

 * postgresql://postgres:***@localhost:5432/pos_db
10 rows affected.

             local
0  Belo Horizonte
1  Queimadas
2  Natal
3  Salvador
4  Porto Alegre
5  Florianopolis
6  Vitoria
7  Cabo Frio
8  Rio de Janeiro
9  São Paulo

In [72]:
%%sql
SELECT	EMPREGADO.NOME, 1.1*SAL AS SALARIOmais10porcento
FROM 		EMPREGADO, TRABALHANO, PROJETO
WHERE 	EMPREGADO.IDENT = TRABALHANO.IDENTEMP
AND 		TRABALHANO.PROJNUM = PROJETO.NUM
AND 		PROJETO.NOME = 'Reengenharia';

 * postgresql://postgres:***@localhost:5432/pos_db
6 rows affected.

                   nome salariomais10porcento
0  Ciclano                           1100.000
1  Raphael Mendes                   24456.300
2  Bruna Carla                       6465.800
3  João Maria                       11000.000
4  Caetano Veloso                    2200.000
5  Johnny Depp                      33001.100

In [74]:
%%sql
SELECT Distinct E.nome, D.num as "Numero se for gerente"
FROM 		        Departamento D RIGHT OUTER JOIN Empregado E
ON 		          E.Ident = D.IdentGer
ORDER BY 	      E.nome

 * postgresql://postgres:***@localhost:5432/pos_db
30 rows affected.

                    nome Numero se for gerente
0   Ariane Goncalves                        10
1   Bianca Lourenco                       None
2   Bruna Carla                              9
3   Bruno Peixoto                         None
4   Caetano Veloso                           5
5   Ciclano                               None
6   Felicidade Maria                      None
7   Joao                                    11
8   Joao                                    15
9   João Maria                               6
10  Johnny Depp                              8
11  Jorge Sousa                              2
12  José Carlos                           None
13  Laura Benayon                         None
14  Leandro Silva                           13
15  Luana Marques                         None
16  Luciana Fernandes                     None
17  Luciano Mauri                           12
18  Marcos Guedes                         None
19  Maria                                    3
20  Maria                                    4
21  Maria                                28319
22  Maria José                               7
23  Natasha Gasparelli                    None
24  Paola Silva                              1
25  Raphael Mendes                        None
26  Raphaela Fontoura                       14
27  Severino Buarque                      9000
28  Silvano Silva                         None
29  Simone Estoggliato                    None

In [75]:
%%sql
SELECT 	E.nome AS NomeEmp, D.nome AS NomeDepto
FROM		empregado E INNER JOIN departamento D
ON 	    E.depnum = D.num
AND 		sal >ALL
            (
              SELECT sal
						  FROM    empregado E INNER JOIN departamento D
						  ON      E.depnum = D.num
              AND 		D.nome = 'Pesquisa'
            )

 * postgresql://postgres:***@localhost:5432/pos_db
8 rows affected.

                nomeemp                  nomedepto
0  Silvano Silva         Informatica
1  Bianca Lourenco       Historia
2  Raphael Mendes        Informatica
3  Marcos Guedes         Economia
4  Natasha Gasparelli    Historia
5  Ariane Goncalves      Matematica
6  Luciano Mauri         Nanotecnologia
7  Johnny Depp           Farmacia

In [ ]:
#13 Listar os nomes dos empregados que trabalham o mesmo total de horas em algum projeto em que o empregado Caetano Veloso trabalha
%%sql
SELECT 	DISTINCT Nome
FROM 		Trabalhano T1, Empregado E1
WHERE 	T1.IdentEmp = E1.Ident
AND		  E1.Nome <> 'Caetano Veloso'
AND 		EXISTS
    (
      SELECT ProjNum, HRS
		 	FROM Trabalhano T2, Empregado E2
		 	WHERE T2.IdentEmp = E2.Ident
		 	AND E2.Nome = 'Caetano Veloso'
		 	AND T2.ProjNum = T1.ProjNum
		 	AND T2.HRS = T1.HRS
    )

In [76]:
%%sql
SELECT ident, nome, sal
FROM   empregado
WHERE  sal IN
  (
    SELECT max(sal)
    FROM   empregado
  )

 * postgresql://postgres:***@localhost:5432/pos_db
1 rows affected.

  ident                  nome       sal
0    10  Johnny Depp           30001.00

In [ ]:
#15 Quais os nomes dos empregados que ganham os 3 maiores salários da empresa?
# solução 1: força bruta ...
%%sql
SELECT ident, nome, sal
FROM empregado
WHERE sal IN
    (SELECT MAX(sal)
     FROM empregado)
OR sal IN
    (SELECT MAX(sal)
     FROM empregado
     WHERE sal NOT IN
        (SELECT MAX(sal)
         FROM empregado))
OR sal IN
    (SELECT MAX(sal)
     FROM empregado
     WHERE sal NOT IN
        (SELECT MAX(sal)
         FROM empregado)
    AND sal NOT IN
        (SELECT MAX(sal)
         FROM empregado
         WHERE sal NOT IN
             (SELECT MAX(sal)
              FROM empregado)))
ORDER BY sal desc

In [77]:

%%sql
SELECT ident, nome, sal
FROM   empregado e1
WHERE  3 >
  (
    SELECT count (distinct SAL)
		FROM   empregado e2
		WHERE  e2.sal > e1.sal
  )
ORDER BY sal desc

 * postgresql://postgres:***@localhost:5432/pos_db
7 rows affected.

  ident                  nome       sal
0    10  Johnny Depp           30001.00
1    19  Ariane Goncalves      23265.00
2     6  Luciano Mauri         23265.00
3    24  Marcos Guedes         23265.00
4    25  Natasha Gasparelli    22233.00
5    20  Raphael Mendes        22233.00
6    11  Silvano Silva         22233.00